#include "RoleSkills.h"

static std::vector<Skill> makeSkills(std::initializer_list<Skill> list) {
    return std::vector<Skill>(list);
}

std::vector<Skill> RoleSkills::getSkills(Role role) {
    switch (role) {

    case Role::Rockerboy:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  6},
            {"Концентрация",                    2},
            {"Общение",                         2},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   6},
            {"Проницательность",                6},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     4},
            {"Внимательность",                  2},
            {"Убеждение",                       6},
            {"Скрытность",                      2},
            {"Композиция",                      6},
            {"Пистолеты",                       6},
            {"Оружие ближнего боя",             6},
            {"Уход за собой",                   4},
            {"Игра на инструменте (выбери 1)",  6},
            {"Знаток улиц",                     6},
            {"Гардероб и стиль",                4},
        });

    case Role::Solo:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         2},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   6},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  6},
            {"Убеждение",                       2},
            {"Скрытность",                      2},
            {"Автоматический огонь (x2)",       6},
            {"Допрос",                          6},
            {"Оружие ближнего боя",             6},
            {"Сопротивление пыткам/наркотикам", 6},
            {"Тактическое оружие",              6},
            {"Тактика",                         6},
        });

    case Role::Netrunner:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         2},
            {"Образование",                     6},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  2},
            {"Убеждение",                       2},
            {"Скрытность",                      6},
            {"Знание техники",                  6},
            {"Скрытие/раскрытие объекта",       6},
            {"Криптография",                    6},
            {"Кибертехника",                    6},
            {"Электроника/Безопасность (x2)",   6},
            {"Пистолеты",                       6},
            {"Поиск информации",                6},
        });

    case Role::Tech:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         2},
            {"Образование",                     6},
            {"Уклонение",                       6},
            {"Первая помощь",                   6},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  2},
            {"Убеждение",                       2},
            {"Скрытность",                      2},
            {"Знание техники",                  6},
            {"Кибертехника",                    6},
            {"Электроника/Безопасность (x2)",   6},
            {"Автомеханика",                    6},
            {"Тактическое оружие",              6},
            {"Наука (выбери 1)",                6},
            {"Оружейник",                       6},
        });

    case Role::Medtech:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         6},
            {"Образование",                     6},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                6},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  2},
            {"Убеждение",                       2},
            {"Скрытность",                      2},
            {"Знание техники",                  6},
            {"Кибертехника",                    4},
            {"Дедукция",                        6},
            {"Парамедик (x2)",                  6},
            {"Сопротивление пыткам/наркотикам", 4},
            {"Наука (выбери 1)",                6},
            {"Тактическое оружие",              6},
        });

    case Role::Media:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         6},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                6},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     6},
            {"Внимательность",                  6},
            {"Убеждение",                       6},
            {"Скрытность",                      2},
            {"Подкуп",                          6},
            {"Композиция",                      6},
            {"Дедукция",                        6},
            {"Пистолеты",                       6},
            {"Поиск информации",                4},
            {"Чтение по губам",                 4},
            {"Кино- и фотография",              4},
        });

    case Role::Lawman:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  6},
            {"Концентрация",                    2},
            {"Общение",                         6},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  2},
            {"Убеждение",                       2},
            {"Скрытность",                      2},
            {"Автоматический огонь",            6},
            {"Криминология",                    6},
            {"Дедукция",                        6},
            {"Допрос",                          6},
            {"Пистолеты",                       6},
            {"Тактическое оружие",              6},
            {"Выслеживание",                    6},
        });

    case Role::Corp:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         6},
            {"Образование",                     6},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  2},
            {"Убеждение",                       6},
            {"Скрытность",                      2},
            {"Бухгалтерия",                     6},
            {"Бюрократия",                      6},
            {"Бизнес",                          6},
            {"Дедукция",                        6},
            {"Пистолеты",                       6},
            {"Чтение по губам",                 6},
            {"Уход за собой",                   4},
        });

    case Role::Fixer:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  2},
            {"Концентрация",                    2},
            {"Общение",                         6},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   2},
            {"Проницательность",                6},
            {"Язык (Уличный сленг)",            4},
            {"Знание местности (Твой дом)",     6},
            {"Внимательность",                  2},
            {"Убеждение",                       4},
            {"Скрытность",                      2},
            {"Подкуп",                          6},
            {"Бизнес",                          6},
            {"Фальсификация",                   6},
            {"Пистолеты",                       6},
            {"Взлом замков",                    4},
            {"Знаток улиц",                     6},
            {"Торговля",                        6},
        });

    case Role::Nomad:
        return makeSkills({
            {"Атлетика",                        2},
            {"Рукопашный бой",                  6},
            {"Концентрация",                    2},
            {"Общение",                         2},
            {"Образование",                     2},
            {"Уклонение",                       6},
            {"Первая помощь",                   6},
            {"Проницательность",                2},
            {"Язык (Уличный сленг)",            2},
            {"Знание местности (Твой дом)",     2},
            {"Внимательность",                  4},
            {"Убеждение",                       2},
            {"Скрытность",                      6},
            {"Обращение с животными",           6},
            {"Вождение",                        6},
            {"Пистолеты",                       6},
            {"Оружие ближнего боя",             6},
            {"Выслеживание",                    6},
            {"Торговля",                        6},
            {"Выживание в пустыне",             6},
        });

    default:
        return {};
    }
}
